# 第一关

USE School;

#请在此处添加实现代码
########## Begin ##########

########## 查询1班同学的所有信息以成绩降序的方式显示结果 ##########
SELECT *
FROM tb_score
WHERE class_id = 1
ORDER BY score DESC;

########## End ##########

# ======================================================================================================================

# 第二关

USE School;

#请在此处添加实现代码
########## Begin ##########

########## 对班级名称进行分组查询 ##########
SELECT *
FROM tb_class
GROUP BY class_id;

########## End ##########


# ======================================================================================================================

# 第三关

USE School;

#请在此处添加实现代码
########## Begin ##########

########## 查询班级中第2名到第5名的学生信息，并根据学生成绩进行降序排序。 ##########
SELECT *
FROM tb_score
ORDER BY score DESC
LIMIT 1,4;

########## End ##########
